Revit 2026 API

# CategoryType Enumeration

---

The type of category.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CategoryType
```
```vb
Public Enumeration CategoryType
```
```cpp
public enum class CategoryType
```
```fsharp
type CategoryType
```

| Member name | Value | Description |
| --- | --- | --- |
| AnalyticalModel | 5 | An analytical model element category. |
| Annotation | 2 | An annotation element category. |
| Internal | 4 | The category is for internal usage. |
| Invalid | 0 | The category type is invalid. |
| Model | 1 | A model element category. |

#### Reference

Autodesk.Revit.DB Namespace